``` sql
create table numbers (n int);
insert into numbers values (1),(2),(3),(4),(5),(9);
select * from numbers;

+------+
| n    |
+------+
|    1 |
|    2 |
|    3 |
|    4 |
|    5 |
|    9 |
+------+

expected output:

+------+
| n    |
+------+
|    1 |
|    2 |
|    2 |
|    3 |
|    3 |
|    3 |
|    4 |
|    4 |
|    4 |
|    4 |
|    5 |
|    5 |
|    5 |
|    5 |
|    5 |
|    9 |
|    9 |
|    9 |
|    9 |
|    9 |
|    9 |
|    9 |
|    9 |
|    9 |
+------+

**Solution:**
``` sql
with recursive cte as(
select max(n) as n from numbers
union
select n-1 as n from cte
where n-1 >= 1)

select a.n
from numbers a
join cte b
on a.n >= b.n
order by a.n asc;